EDT_User_Elena/src/DataProcessors/Продажи_1/Продажи_1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Продажи_1</name>
  <attributes>
    <name>ТЗ</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
    <attributes>
      <name>Покупатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщСум</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщКол</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

EDT_User_Elena/src/DataProcessors/Продажи_1/Forms/Форма/Module.bsl
&НаСервере
Функция ВыборкаИзРегистра(ДН,ДК)
	
	МакетТД = Обработки.Продажи_1.ПолучитьМакет("Макет");
	ОбластьШапка = МакетТД.ПолучитьОбласть("Шапка");
	ОбластьСтрока = МакетТД.ПолучитьОбласть("Строка"); 
	
	ОбластьШапка.Параметры.ДатаНач=Лев(ДН,10); 
	ОбластьШапка.Параметры.ДатаКон=Лев(ДК,10);


	//////////////////////////-	
	Таб = Новый ТаблицаЗначений;  
	Таб.Колонки.Добавить("Покупатель");
	Таб.Колонки.Добавить("Товар");
	Таб.Колонки.Добавить("Количество");
	Таб.Колонки.Добавить("Сумма");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   ПродажиЗАПериод.Период,
	|   ПродажиЗАПериод.Покупатель,
	|   ПродажиЗАПериод.Товар,
	|   ПродажиЗАПериод.Количество,
	|   ПродажиЗАПериод.Сумма
	|ИЗ
	|   РегистрНакопления.Продажи КАК ПродажиЗАПериод
	|ГДЕ
	|   ПродажиЗАПериод.Период МЕЖДУ &НачПериод И &КонПериод
	|УПОРЯДОЧИТЬ ПО
	|   ПродажиЗАПериод.Период";
	
	Запрос.УстановитьПараметр("НачПериод", ДН);
	Запрос.УстановитьПараметр("КонПериод", ДК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Записи = РезультатЗапроса.Выбрать();
	
	Пока Записи.Следующий() Цикл
		Стр = Таб.Добавить();
		Стр.Покупатель = Записи.Покупатель;
		Стр.Товар = Записи.Товар;
		Стр.Количество = Записи.Количество;
		Стр.Сумма = Записи.Сумма;
	КонецЦикла;  
	
	ТабДок.Вывести(ОбластьШапка); 
	Таб.Свернуть("Покупатель", "Количество,Сумма"); 
	
	Для Каждого Стр Из Таб Цикл
		ОбластьСтрока.Параметры.Покупатель=Стр.Покупатель;
		ОбластьСтрока.Параметры.Колво=Стр.Количество;
		ОбластьСтрока.Параметры.Сум=Стр.Сумма;
		ТабДок.Вывести(ОбластьСтрока); 
	КонецЦикла;
	
	
КонецФункции

&НаСервере
Процедура ПечатьНаСервере() 
	
	ВыборкаИзРегистра(ДатаНач,ДатаКон);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ПечатьНаСервере();
КонецПроцедуры
